In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
from sqlite3 import Row


df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,3,234],[3,6,8,23],[23,23,63,12]],columns=['A','B','C','D'])

In [4]:
df1.head()

    A   B   C    D
0   1   2   3    4
1   5   6   7    8
2   2   7   3  234
3   3   6   8   23
4  23  23  63   12

In [5]:
df1.iloc[0:2,1:3]

   B  C
0  2  3
1  6  7